# Seth Elias
## Week 13 - 11/12/24
### Python Pandas dataframe processing

In [1]:
import numpy as np
from pandas import *
import pandas as pd

In [2]:
#drop entries
df = DataFrame(np.arange(16).reshape(4,4), index = ['Ohio', 'Colorado', 'Utah', 'New York'], columns = ['one', 'two', 'three', 'four'])

In [3]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [4]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [5]:
df.index

Index(['Ohio', 'Colorado', 'Utah', 'New York'], dtype='object')

In [6]:
df.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [7]:
df.info

<bound method DataFrame.info of           one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15>

In [8]:
df.describe

<bound method NDFrame.describe of           one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15>

In [9]:
df.mean()

one      6.0
two      7.0
three    8.0
four     9.0
dtype: float64

In [10]:
df1 = df.copy

In [11]:
df1

<bound method NDFrame.copy of           one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15>

In [12]:
df.drop(['Colorado'])

          one  two  three  four
Ohio        0    1      2     3
Utah        8    9     10    11
New York   12   13     14    15

In [13]:
df.drop(['Ohio', 'Utah'])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [14]:
df.drop('two')

KeyError: "['two'] not found in axis"

In [ ]:
df.drop('two', axis = 1)

In [ ]:
df

In [ ]:
df.drop(['four', 'two'], axis ='columns')

In [ ]:
df.drop(['four', 'two'], axis ='columns', inplace = True)

In [ ]:
df

In [ ]:
df1

In [ ]:
df['one']

In [ ]:
df[['one', 'three']]

In [ ]:
df[:2]

In [ ]:
df[df['three'] > 5]

In [ ]:
df > 5

In [ ]:
df1 > 5

In [ ]:
df.loc['Colorado']

In [ ]:
df.loc['Colorado',['one']]

In [ ]:
df

In [ ]:
# selecting entries using index, like numpy
df.iloc[2]

In [ ]:
df.iloc[0,3]

In [ ]:
df.iloc[2,[1,3]]

In [ ]:
df.iloc[:2,[0,1]]

In [ ]:
df.iloc[:,-1]

In [ ]:
# data alignment
df1 = DataFrame(np.arange(9).reshape(3,3),
               columns = list('bcd'),
               index = ['Ohio', 'Texas', 'Colorado'])

In [ ]:
df1

In [ ]:
df2 = DataFrame(np.arange(12).reshape(4,3),
               columns = list('bde'),
               index = ['Utah', ' Ohio', 'Texas', 'Oregon'])

In [ ]:
df2

In [ ]:
df1 + df2

In [ ]:
df1.add(df2, fill_value=0)

In [ ]:
df1

In [ ]:
df1['e'] = df1['b'] + df1['d']
df1

In [ ]:
df1.add(df2, fill_value = 0)

In [ ]:
#Operation between DataFrame and Series
s = df2.iloc[0]
s

In [ ]:
df2.iloc[0][1]

In [ ]:
s

In [ ]:
df2 - s

In [ ]:
df2

In [ ]:
#sorting and ranking data
df = DataFrame(np.arange(8).reshape(2,4)*10,
              columns = list('dabc'),
              index = ['three', 'one'])

In [ ]:
df

In [ ]:
df.sort_index()

In [ ]:
df.sort_index(axis = 1)

In [ ]:
df.sort_index(axis=1, ascending = False)

In [ ]:
df = DataFrame({'b': [4,7,-3,2], 'a': [0, -1, 3, 2]})

In [ ]:
df

In [ ]:
df.sort_values(by='b')

In [ ]:
df.sort_values(by = 'a')

In [ ]:
df.sort_values(by=['a','b'])

In [ ]:
#ranking data
df5 = DataFrame({'b': [14,17,-13,12], 'a': [10,11,15,11]})

In [ ]:
df5

In [ ]:
df5.rank()

In [ ]:
df5.rank().astype(int)

In [ ]:
#summarizing data
df = DataFrame([ [1.4,np.nan], [7.1,-4.5], [np.nan,np.nan], [0.75,-1.3]],
              index = list('abcd'),
              columns = ['one', 'two'])

In [ ]:
df.sum()

In [ ]:
df.mean()

In [ ]:
df.min()

In [ ]:
df.min(axis = 1)

In [ ]:
df.idxmax()

In [16]:
# missing data, np.nan
#create dataframe representing stock prices
data = {
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04'],
    'META': [150, 155, 148, 160],
    'TSLA': [200, 210, 195, 220],
    'GOOGL': [100, 105, 98, 110]
}
df = DataFrame(data)
df.set_index('Date', inplace = True)
df

            META  TSLA  GOOGL
Date
2023-01-01   150   200    100
2023-01-02   155   210    105
2023-01-03   148   195     98
2023-01-04   160   220    110

In [18]:
# fnd the date with the highest closing price for each stock
df.idxmax()

META     2023-01-04
TSLA     2023-01-04
GOOGL    2023-01-04
dtype: object

In [19]:
df.idxmin()

META     2023-01-03
TSLA     2023-01-03
GOOGL    2023-01-03
dtype: object

In [20]:
df.idxmax(axis = 1)

Date
2023-01-01    TSLA
2023-01-02    TSLA
2023-01-03    TSLA
2023-01-04    TSLA
dtype: object

In [21]:
df.idxmin(axis = 1)

Date
2023-01-01    GOOGL
2023-01-02    GOOGL
2023-01-03    GOOGL
2023-01-04    GOOGL
dtype: object

In [22]:
df_t = df.T

In [23]:
df_t

Date   2023-01-01  2023-01-02  2023-01-03  2023-01-04
META          150         155         148         160
TSLA          200         210         195         220
GOOGL         100         105          98         110

In [24]:
df_t.idxmax()

Date
2023-01-01    TSLA
2023-01-02    TSLA
2023-01-03    TSLA
2023-01-04    TSLA
dtype: object

In [25]:
df_t.idxmax(axis = 1)

META     2023-01-04
TSLA     2023-01-04
GOOGL    2023-01-04
dtype: object

In [26]:
df_t['2023-01-03'].idxmax()

'TSLA'

In [27]:
df_t['2023-01-03'].idxmin()

'GOOGL'

In [30]:
#missing data
df = DataFrame([ [1,2,3,4], [np.nan, 5,6], [7,np.nan,9], [np.nan,np.nan,np.nan] ])

In [31]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [32]:
#dropna
df_copy = df.copy()
df.dropna()

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [34]:
df.dropna(how='all')#only drop a row where all values are missing

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN

In [35]:
# keep only the rows with 2 or more valid data points
df.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN

In [36]:
df.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [37]:
df.dropna(thresh=3, axis = 1)

     2
0  3.0
1  6.0
2  9.0
3  NaN

In [38]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.0  6.0  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [39]:
df.fillna(0)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  0.0  5.0  6.0  0.0
2  7.0  0.0  9.0  0.0
3  0.0  0.0  0.0  0.0

In [41]:
df.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  1.0  5.0  6.0  1.0
2  7.0  1.0  9.0  1.0
3  1.0  1.0  1.0  1.0

In [42]:
df.fillna(0, inplace = True)

In [43]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  0.0  5.0  6.0  0.0
2  7.0  0.0  9.0  0.0
3  0.0  0.0  0.0  0.0

In [44]:
data = {
    'CustomerID': [1001,1002,1003,1004],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, None, 22],
    'Income': [50000, None, 70000, 60000]
}
df = DataFrame(data)
df

   CustomerID     Name   Age   Income
0        1001    Alice  25.0  50000.0
1        1002      Bob  30.0      NaN
2        1003  Charlie   NaN  70000.0
3        1004    David  22.0  60000.0

In [45]:
df.fillna(0)

   CustomerID     Name   Age   Income
0        1001    Alice  25.0  50000.0
1        1002      Bob  30.0      0.0
2        1003  Charlie   0.0  70000.0
3        1004    David  22.0  60000.0

In [47]:
# filling with a specific value
df['Age'].fillna(df['Age'].mean(), inplace = True)

In [48]:
df

   CustomerID     Name        Age   Income
0        1001    Alice  25.000000  50000.0
1        1002      Bob  30.000000      NaN
2        1003  Charlie  25.666667  70000.0
3        1004    David  22.000000  60000.0

In [49]:
df['Age']=df['Age'].astype(int)

In [50]:
df

   CustomerID     Name  Age   Income
0        1001    Alice   25  50000.0
1        1002      Bob   30      NaN
2        1003  Charlie   25  70000.0
3        1004    David   22  60000.0

In [51]:
#This replaes age amd income with the average age and income values
df.fillna({'Age': df['Age'].mean(), 'Income': df["Income"].median()})

   CustomerID     Name  Age   Income
0        1001    Alice   25  50000.0
1        1002      Bob   30  60000.0
2        1003  Charlie   25  70000.0
3        1004    David   22  60000.0

In [52]:
data = {
    'CustomerID': [1001,1002,1003,1004],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, None, 22],
    'Income': [50000, None, 70000, 60000]
}
df = DataFrame(data)
df

   CustomerID     Name   Age   Income
0        1001    Alice  25.0  50000.0
1        1002      Bob  30.0      NaN
2        1003  Charlie   NaN  70000.0
3        1004    David  22.0  60000.0

In [53]:
df.dropna()

   CustomerID   Name   Age   Income
0        1001  Alice  25.0  50000.0
3        1004  David  22.0  60000.0

In [54]:
df.dropna(subset=['Age', 'Income'])

   CustomerID   Name   Age   Income
0        1001  Alice  25.0  50000.0
3        1004  David  22.0  60000.0

In [56]:
#value counts
data = {
    'Qu1':[10,30,40,30,40],
    'Qu2':[20,30,10,20,30],
    'Qu3':[10,50,20,40,40],
    
}
df = DataFrame(data, index = ['a', 'b', 'c', 'd', 'e'])
df

   Qu1  Qu2  Qu3
a   10   20   10
b   30   30   50
c   40   10   20
d   30   20   40
e   40   30   40

In [57]:
df['Qu1'].value_counts()

30    2
40    2
10    1
Name: Qu1, dtype: int64

In [58]:
df['Qu2'].value_counts()

30    2
20    2
10    1
Name: Qu2, dtype: int64

In [59]:
df.loc['a'].value_counts()

10    2
20    1
Name: a, dtype: int64

In [62]:
df.apply(pd.value_counts)

    Qu1  Qu2  Qu3
10  1.0  1.0  1.0
20  NaN  2.0  1.0
30  2.0  2.0  NaN
40  2.0  NaN  2.0
50  NaN  NaN  1.0

In [64]:
df.apply(pd.value_counts).fillna(0).astype(int)

    Qu1  Qu2  Qu3
10    1    1    1
20    0    2    1
30    2    2    0
40    2    0    2
50    0    0    1

In [65]:
rs.index_name ='Values'

NameError: name 'rs' is not defined

In [66]:
df.columns.name='counts'

In [67]:
df

counts  Qu1  Qu2  Qu3
a        10   20   10
b        30   30   50
c        40   10   20
d        30   20   40
e        40   30   40

In [68]:
#sample data
data = {
    'Order ID': [1001, 2001, 3001, 4001, 5001],
    'Product': ['T-shirt', 'Hoodie', 'T-shirt', 'Mug', 'Hoodie']
}
df = DataFrame(data)
df

   Order ID  Product
0      1001  T-shirt
1      2001   Hoodie
2      3001  T-shirt
3      4001      Mug
4      5001   Hoodie

In [69]:
df['Product'].value_counts()

T-shirt    2
Hoodie     2
Mug        1
Name: Product, dtype: int64